---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointFlexibleConstrained
source: html/fe35110e-81fb-b815-440a-38d37bf659a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointFlexibleConstrained Property

"Constrained"

## Syntax (C#)
```csharp
public static ForgeTypeId PointFlexibleConstrained { get; }
```